src/cf/InformationRegisters/СостоянияОбменовЭДСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбменовЭДСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследняяДатаПолученияЭД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПрограммыБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПрограммыБанка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АльфаБанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезДопОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АсинхронныйОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iBank2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияОбменовЭДСБанками/Forms/РедактированиеЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СоглашениеЭД") Тогда
		ТекущаяЗапись = РегистрыСведений.СостоянияОбменовЭДСБанками.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.НастройкаЭДО = Параметры.СоглашениеЭД;
		ТекущаяЗапись.Прочитать();
		
		// Для нового соглашения ЭД записей в регистре еще нет
		Если Не ТекущаяЗапись.Выбран() Тогда
			ТекущаяЗапись.НастройкаЭДО = Параметры.СоглашениеЭД;
		КонецЕсли;
	
		ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
		
		ПрограммаБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СоглашениеЭД, "ПрограммаБанка");
		
	КонецЕсли;
	
	Если Не ПрограммаБанка = Перечисления.ПрограммыБанка.СбербанкОнлайн Тогда
		Элементы.Метка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
